src/toir_cfe/src/Documents/ВнутреннееПотреблениеТоваров/ВнутреннееПотреблениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b726b4a4-d691-4fa0-bef7-e6f1bd056cbf">
  <name>ВнутреннееПотреблениеТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="6ac93f4f-ec62-46e7-b4ca-38e795bf02db">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9bf2417c-ed59-4c71-a254-2f2338f41425">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4f821681-4f9b-4186-85f8-a081e4ab09cf">
    <name>ПотреблениеПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8f13106d-31d1-441b-8330-ef025f55fdbf">
    <name>ЗаказНаВнутреннееПотребление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a69f874-6aec-457e-8ade-4fb7762659ab">
    <name>проф_ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="048b6482-1229-4a9b-bde1-a32f6b28cf3d">
    <name>проф_ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c978a924-8a72-4669-a86a-a1e5e31fd099">
    <name>ЕстьРасхождения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="385ab3ce-dd41-4c25-b89b-974bb478f380">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="54be410d-2466-478e-8cf5-434ec98e19f1">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1b8217a5-5b59-453d-b479-c9c962e72312">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="39aa0f15-c415-409c-a64b-12fd0ee1e845">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="80440cbb-f97b-4620-8eca-b89f9a033f08">
  <name>ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2d1fe73e-1f3d-4ee9-9dd1-010dfff742b1">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="70b08d50-30e9-4115-9e39-67ef989c58b2">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c9fd5a1a-3aa5-4048-b15e-f8b6a41ab96f">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="29d5a4e7-4544-4ed2-a8bf-d541eef13703">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f81fa13f-989c-43f8-a8bc-c4493200a00f">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cfe/src/AccumulationRegisters/торо_РезервыНаСкладах/торо_РезервыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="98b94913-15ed-4617-8385-ab2daba22f81">
  <name>торо_РезервыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="96806bd1-1388-482a-bf3b-489a7bb1618f">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="1b512fd8-7b48-4d08-93b9-cfb739198abd">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b5f04b06-dd61-4f1e-8ffb-697e21d86316">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="e7b625fb-45af-423f-8960-59d2cd4c0f2e">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="323fac0c-b396-4203-b0a2-adf8ac42f936">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b00a4ae7-3813-4dbf-8c92-4d85cc0b5541">
    <name>ЗаказНаВнутреннееПотребление</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="bab26d2a-59a2-481b-b08d-32ff66a42026">
    <name>ДокументРезерв</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cfe/src/AccumulationRegisters/ЗаказыНаВнутреннееПотребление/ЗаказыНаВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f8e3cf62-a29a-4eb6-a0cd-e005b9df98cc">
  <name>ЗаказыНаВнутреннееПотребление</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="3b3e1e2b-83d4-4335-a03f-8801607a9128">
    <name>КОформлению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="c4f0e75b-3aa7-4acb-9b3b-e7fc3b1c66e2">
    <name>ЗаказНаВнутреннееПотребление</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="92ba211b-e615-40a8-aaf1-faae851399f1">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="581e19d8-10ab-490b-8ae2-4316b7e81b6c">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="897933ed-4417-494e-a54b-4e8adf9b7794">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cfe/src/AccumulationRegisters/проф_ТоварыНаСкладах/проф_ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3f2b5e01-847b-49d9-b668-ee6122445039">
  <name>проф_ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="78a7323c-7389-4599-84d6-fde6c3c3533d">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="9c39d63c-41cb-4486-a9ee-180052b85921">
    <name>КонтролироватьОстатки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="8289f7d9-fa0a-45f7-be0c-238495f87a84">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="8df19511-0c7e-41a8-90eb-f953e351a534">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="bd312888-71b8-45b3-bbf7-970c05bc2727">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="951359e6-820e-4f61-a602-16a239f40091">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="328ce0e5-8d0f-4315-8e53-033acc81fdd0">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cfe/src/AccumulationRegisters/проф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт/проф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6ae04480-96d0-4b42-a38a-77468b8202a6">
  <name>проф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="08ca1fe2-22ec-4b93-a944-e923fd69ea51">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="b0a906f0-c1ef-48b1-9e3c-1419f3d9e085">
    <name>АктОВыполненииЭтапаРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="cf269c73-3461-41b0-b4ca-c1d0165d64a0">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="94b5fc89-114f-4c0b-bbfc-774d7d18f1fb">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cfe/src/InformationRegisters/торо_ИнтеграцияДокументов/торо_ИнтеграцияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="17a02a98-8e64-4576-9b3b-4cfc58e2d8cf">
  <name>торо_ИнтеграцияДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions extendedConfigurationObject="e9a88077-61c6-452d-90f2-47d4f24e77da">
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="4736aca1-8591-4fd1-81ac-2e197db4fc05">
    <name>ДокументТОИР</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="e9f3faae-f405-4f24-9277-030e531fcfbb">
    <name>ДокументЕРП</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/Enums/проф_ХозяйственнаяОперация/проф_ХозяйственнаяОперация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="85d9c202-c830-4b20-b1d3-c80f4675f995">
  <name>проф_ХозяйственнаяОперация</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="311163c4-23a7-4c14-be3f-1d4bf4634f6a">
    <name>СписаниеТоваровПоТребованию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="fe871ca1-2b53-415b-afd7-df7a45c2dc7f">
    <name>ПередачаВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/toir_cfe/src/Documents/ЗаказНаВнутреннееПотребление/ЗаказНаВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0281d76f-6aa0-4fff-ab25-5a81258abfb3">
  <name>ЗаказНаВнутреннееПотребление</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="41f4f6c1-a9c4-443f-97b5-62a83d5a9725">
    <name>проф_Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="feae67ed-6dc9-49c5-a307-3811be01be0e">
    <name>проф_ЗаказДляЗакупки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3130c2d1-275a-4006-8bec-ffc8eadaf912">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="aaee8848-18c0-4459-8461-a6f8cde70246">
    <name>торо_СозданПоПотребности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="873a5588-15b7-419a-ac32-2cfcdd64f86d">
    <name>проф_ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3c7396b0-71b0-4c54-b9bf-4c429c4af1f6">
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a9600285-8615-4521-86d8-2bca0bfd8ec8">
    <name>проф_НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3a3c3667-121d-46f4-9b5f-3490c0bc2096">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ff47e900-26d4-480f-862d-e7a594cde170">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9cd34090-ac80-44d9-b29a-f37fc28b0c69">
    <name>торо_СтатусУтверждения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="0c65fe73-4b60-4819-b7d6-6271b93f49c0">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="f24b0b4d-40fc-46e5-9a5c-1c14fd1080ca">
    <name>проф_ТоварыИсточника</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Documents/ВнутреннееПотреблениеТоваров/ObjectModule.bsl
#Область ОбработчикиСобытий

&ИзменениеИКонтроль("ОбработкаПроверкиЗаполнения")
Процедура проф_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Перем МассивВсехРеквизитов;
	Перем МассивРеквизитовОперации;


	МассивНепроверяемыхРеквизитов = Новый Массив;

	// Проверка количества в т.ч. товары.
	ОбщегоНазначенияУТ.ПроверитьЗаполнениеКоличества(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ);

	// Проверка характеристик в т.ч. товары.
	ФОИспользоватьХарактеристикиНоменклатуры = ПолучитьФункциональнуюОпцию("торо_ИспользоватьХарактеристикиНоменклатуры");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.Характеристика");
	Если ФОИспользоватьХарактеристикиНоменклатуры Тогда
		НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект,МассивНепроверяемыхРеквизитов,Отказ);
	КонецЕсли;

	// Если накладная по заказу - то код строки должен быть заполнен.
	Если Не ЗначениеЗаполнено(ЗаказНаВнутреннееПотребление) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.КодСтроки");
	КонецЕсли;

	Если ЕстьРасхождения Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары");
	КонецЕсли;

	ФОИспользоватьСерииНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.Серия");
	Если ФОИспользоватьСерииНоменклатуры = Истина тогда
		НоменклатураСервер.ПроверитьЗаполнениеСерий(ЭтотОбъект,
		Отказ,
		МассивНепроверяемыхРеквизитов);
	КонецЕсли;
	#Вставка
	//++ Проф-ИТ, #183, Соловьев А.А., 03.10.2023
	Если проф_ХозяйственнаяОперация <> Перечисления.проф_ХозяйственнаяОперация.ПередачаВЭксплуатацию Тогда 
		МассивНепроверяемыхРеквизитов.Добавить("Товары.проф_КатегорииЭксплуатации");
		МассивНепроверяемыхРеквизитов.Добавить("Товары.проф_ФизическоеЛицо");
	Иначе
		//++ Проф-ИТ, #303, Корнилов М.С., 13.10.2023
		проф_ПроверитьТЧТоварыИнвентарныйНомер(Отказ);
		//-- Проф-ИТ, #303, Корнилов М.С., 13.10.2023
	КонецЕсли;
	//-- Проф-ИТ, #183, Соловьев А.А., 03.10.2023
	#КонецВставки

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);

КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура проф_ОбработкаПроведения(Отказ, РежимПроведения)

	ФОИспользоватьСерии = Константы.ИспользоватьСерииНоменклатуры.Получить();
	ФОИспользоватьХарактеристики = Константы.торо_ИспользоватьХарактеристикиНоменклатуры.Получить();	
	ИспользуетсяКонтрольОстатков = Константы.торо_ИспользоватьКонтрольОтрицательныхОстатков.Получить();

	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.торо_ТоварыНаРуках.Записывать = Истина;
	Движения.торо_РезервыНаРуках.Записывать = Истина;
	Движения.торо_РезервыНаСкладах.Записывать = Истина;
	Движения.ЗаказыНаВнутреннееПотребление.Записывать = Истина;

	#Вставка
	//++ Проф-ИТ, #27, Соловьев А.А., 24.08.2023
	Движения.проф_ТоварыНаСкладах.Записывать = Истина;	
	//-- Проф-ИТ, #27, Соловьев А.А., 24.08.2023
	#КонецВставки
	// контроль остатков

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВнутреннееПотреблениеТовары.Номенклатура КАК Номенклатура,
	|	&Характеристика КАК Характеристика,
	|	ВнутреннееПотреблениеТовары.Упаковка КАК Упаковка,
	|	ВнутреннееПотреблениеТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ВнутреннееПотреблениеТовары.Количество КАК Количество,
	|	ВнутреннееПотреблениеТовары.КодСтроки КАК КодСтроки,
	|	ВнутреннееПотреблениеТовары.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотребление,
	|	ВнутреннееПотреблениеТовары.НомерСтроки КАК НомерСтроки,
	|	&Склад КАК Склад,
	#Вставка
	//++ Проф-ИТ, #27, Соловьев А.А., 24.08.2023
	|	ВнутреннееПотреблениеТовары.проф_Назначение КАК Назначение,
	//-- Проф-ИТ, #27, Соловьев А.А., 24.08.2023
	#КонецВставки
	|	&Серия КАК Серия
	|ПОМЕСТИТЬ Таблица
	|ИЗ
	|	Документ.ВнутреннееПотреблениеТоваров.Товары КАК ВнутреннееПотреблениеТовары
	|ГДЕ
	|	ВнутреннееПотреблениеТовары.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка",	Ссылка);
	Запрос.УстановитьПараметр("Склад" ,	Склад);

	Если ФОИспользоватьСерии Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Серия", "ВнутреннееПотреблениеТовары.Серия");	
	Иначе
		Запрос.УстановитьПараметр("Серия", Справочники.СерииНоменклатуры.ПустаяСсылка());	
	КонецЕсли;

	Если ФОИспользоватьХарактеристики Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Характеристика", "ВнутреннееПотреблениеТовары.Характеристика");
	Иначе
		Запрос.УстановитьПараметр("Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	КонецЕсли;

	Запрос.Выполнить();

	УстановитьБлокировку();

	// проверка остатков
	Запрос.Текст = "ВЫБРАТЬ
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ТабТовары.Склад КАК Склад,
	|	ТабТовары.Характеристика КАК Характеристика,
	|	ТабТовары.Серия КАК Серия,
	|	ТабТовары.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотребление,
	|	СУММА(ТабТовары.Количество) КАК Количество,
	|	СпрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ ТЧБезДублей
	|ИЗ
	|	Таблица КАК ТабТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабТовары.Номенклатура = СпрНоменклатура.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабТовары.Номенклатура,
	|	ТабТовары.Характеристика,
	|	ТабТовары.Серия,
	|	ТабТовары.Склад,
	|	ТабТовары.ЗаказНаВнутреннееПотребление,
	|	СпрНоменклатура.ЕдиницаИзмерения
	|;
	#Вставка
	//++ Проф-ИТ, #27, Соловьев А.А., 24.08.2023
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ТабТовары.Склад КАК Склад,
	|	ТабТовары.Назначение КАК Назначение,
	|	ТабТовары.Характеристика КАК Характеристика,
	|	ТабТовары.Серия КАК Серия,
	|	ТабТовары.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотребление,
	|	СУММА(ТабТовары.Количество) КАК Количество,
	|	СпрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ проф_ТЧБезДублей
	|ИЗ
	|	Таблица КАК ТабТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТабТовары.Номенклатура = СпрНоменклатура.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабТовары.Номенклатура,
	|	ТабТовары.Характеристика,
	|	ТабТовары.Серия,
	|	ТабТовары.Склад,
	|	ТабТовары.Назначение,
	|	ТабТовары.ЗаказНаВнутреннееПотребление,
	|	СпрНоменклатура.ЕдиницаИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
	|	ТоварыНаСкладахОстатки.Склад КАК Склад,
	|	ТоварыНаСкладахОстатки.Назначение КАК Назначение,
	|	ТоварыНаСкладахОстатки.Серия КАК Серия,
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток
	|ПОМЕСТИТЬ проф_ТоварыНаСкладахОстатки
	|ИЗ
	|	РегистрНакопления.проф_ТоварыНаСкладах.Остатки(
	|			&Дата,
	|			(Номенклатура, Характеристика, Склад, Серия, Назначение) В
	|				(ВЫБРАТЬ
	|					Таблица.Номенклатура,
	|					Таблица.Характеристика,
	|					Таблица.Склад,
	|					Таблица.Серия,
	|					Таблица.Назначение
	|				ИЗ
	|					Таблица КАК Таблица)) КАК ТоварыНаСкладахОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Склад,
	|	Серия,
	|	Назначение
	|;
	//-- Проф-ИТ, #27, Соловьев А.А., 24.08.2023
	#КонецВставки
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
	|	ТоварыНаСкладахОстатки.Склад КАК Склад,
	|	ТоварыНаСкладахОстатки.Серия КАК Серия,
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток
	|ПОМЕСТИТЬ ТоварыНаСкладахОстатки
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			&Дата,
	|			(Номенклатура, Характеристика, Серия, Склад) В
	|				(ВЫБРАТЬ
	|					Таблица.Номенклатура,
	|					Таблица.Характеристика,
	|					Таблица.Серия,
	|					Таблица.Склад
	|				ИЗ
	|					Таблица КАК Таблица)) КАК ТоварыНаСкладахОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Склад,
	|	Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_РезервыНаСкладахОстатки.Склад КАК Склад,
	|	торо_РезервыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	торо_РезервыНаСкладахОстатки.Характеристика КАК Характеристика,
	|	торо_РезервыНаСкладахОстатки.Серия КАК Серия,
	|	&ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотребление,
	|	СУММА(торо_РезервыНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ РезервыНаСкладах
	|ИЗ
	|	РегистрНакопления.торо_РезервыНаСкладах.Остатки(
	|			&Дата,
	|			(Номенклатура, Характеристика, Серия, Склад) В
	|				(ВЫБРАТЬ
	|					Таблица.Номенклатура,
	|					Таблица.Характеристика,
	|					Таблица.Серия,
	|					Таблица.Склад
	|				ИЗ
	|					Таблица)) КАК торо_РезервыНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	&ЗаказНаВнутреннееПотребление,
	|	торо_РезервыНаСкладахОстатки.Номенклатура,
	|	торо_РезервыНаСкладахОстатки.Характеристика,
	|	торо_РезервыНаСкладахОстатки.Склад,
	|	торо_РезервыНаСкладахОстатки.Серия
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Склад,
	|	Серия,
	|	ЗаказНаВнутреннееПотребление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ТоварыНаРукахОстатки.Номенклатура КАК Номенклатура,
	|	торо_ТоварыНаРукахОстатки.Характеристика КАК Характеристика,
	|	торо_ТоварыНаРукахОстатки.Склад КАК Склад,
	|	торо_ТоварыНаРукахОстатки.Серия КАК Серия,
	|	торо_ТоварыНаРукахОстатки.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотребление,
	|	торо_ТоварыНаРукахОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ТоварыНаРуках
	|ИЗ
	|	РегистрНакопления.торо_ТоварыНаРуках.Остатки(
	|			&Дата,
	|			(Номенклатура, Характеристика, Серия, Склад, ЗаказНаВнутреннееПотребление) В
	|				(ВЫБРАТЬ
	|					Таблица.Номенклатура,
	|					Таблица.Характеристика,
	|					Таблица.Серия,
	|					Таблица.Склад,
	|					Таблица.ЗаказНаВнутреннееПотребление
	|				ИЗ
	|					Таблица)) КАК торо_ТоварыНаРукахОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Склад,
	|	Серия,
	|	ЗаказНаВнутреннееПотребление
	#Вставка
	//++ Проф-ИТ, #27, Соловьев А.А., 24.08.2023
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ТабТовары.Характеристика КАК Характеристика,
	|	ТабТовары.Склад КАК Склад,
	|	ТабТовары.Серия КАК Серия,
	|	ТабТовары.Назначение КАК Назначение,
	|	ЕСТЬNULL(проф_ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) КАК СвобОстаток,
	|	ТабТовары.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотребление,
	|	ТабТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(проф_ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) КАК НаСкладе,
	|	ТабТовары.Количество КАК Количество
	|ПОМЕСТИТЬ проф_Остатки
	|ИЗ
	|	проф_ТЧБезДублей КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ проф_ТоварыНаСкладахОстатки КАК проф_ТоварыНаСкладахОстатки
	|		ПО ТабТовары.Номенклатура = проф_ТоварыНаСкладахОстатки.Номенклатура
	|			И ТабТовары.Характеристика = проф_ТоварыНаСкладахОстатки.Характеристика
	|			И ТабТовары.Серия = проф_ТоварыНаСкладахОстатки.Серия
	|			И ТабТовары.Склад = проф_ТоварыНаСкладахОстатки.Склад
	|			И ТабТовары.Назначение = проф_ТоварыНаСкладахОстатки.Назначение
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабТовары.Номенклатура,
	|	ТабТовары.Характеристика,
	|	ТабТовары.Склад,
	|	ТабТовары.Назначение,
	|	ТабТовары.Серия,
	|	ТабТовары.ЗаказНаВнутреннееПотребление,
	|	проф_ТоварыНаСкладахОстатки.ВНаличииОстаток,
	|	ТабТовары.Количество,
	|	ТабТовары.ЕдиницаИзмерения
	//-- Проф-ИТ, #27, Соловьев А.А., 24.08.2023
	#КонецВставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабТовары.Номенклатура КАК Номенклатура,
	|	ТабТовары.Характеристика КАК Характеристика,
	|	ТабТовары.Склад КАК Склад,
	|	ТабТовары.Серия КАК Серия,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) + ЕСТЬNULL(ТоварыНаРуках.КоличествоОстаток, 0) - СУММА(ЕСТЬNULL(Резервы.КоличествоОстаток, 0)) КАК СвобОстаток,
	|	ТабТовары.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотребление,
	|	ТабТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) - СУММА(ЕСТЬNULL(Резервы.КоличествоОстаток, 0)) КАК НаСкладе,
	|	ЕСТЬNULL(ТоварыНаРуках.КоличествоОстаток, 0) КАК НаРуках,
	|	ТабТовары.Количество КАК Количество
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	ТЧБезДублей КАК ТабТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыНаСкладахОстатки КАК ТоварыНаСкладахОстатки
	|		ПО ТабТовары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|			И ТабТовары.Характеристика = ТоварыНаСкладахОстатки.Характеристика
	|			И ТабТовары.Серия = ТоварыНаСкладахОстатки.Серия
	|			И ТабТовары.Склад = ТоварыНаСкладахОстатки.Склад
	|		ЛЕВОЕ СОЕДИНЕНИЕ РезервыНаСкладах КАК Резервы
	|		ПО ТабТовары.Склад = Резервы.Склад
	|			И ТабТовары.Номенклатура = Резервы.Номенклатура
	|			И (&ВнутреннийЗаказ)
	|			И ТабТовары.Характеристика = Резервы.Характеристика
	|			И ТабТовары.Серия = Резервы.Серия
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыНаРуках КАК ТоварыНаРуках
	|		ПО ТабТовары.Склад = ТоварыНаРуках.Склад
	|			И ТабТовары.Номенклатура = ТоварыНаРуках.Номенклатура
	|			И ТабТовары.ЗаказНаВнутреннееПотребление = ТоварыНаРуках.ЗаказНаВнутреннееПотребление
	|			И ТабТовары.Характеристика = ТоварыНаРуках.Характеристика
	|			И ТабТовары.Серия = ТоварыНаРуках.Серия
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабТовары.Номенклатура,
	|	ТабТовары.Характеристика,
	|	ТабТовары.Склад,
	|	ТабТовары.Серия,
	|	ТабТовары.ЗаказНаВнутреннееПотребление,
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток,
	|	ТабТовары.Количество,
	|	ТабТовары.ЕдиницаИзмерения,
	|	ТоварыНаРуках.КоличествоОстаток";


	Если ПотреблениеПоЗаказам Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВнутреннийЗаказ", "ТабТовары.ЗаказНаВнутреннееПотребление <> Резервы.ЗаказНаВнутреннееПотребление");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЗаказНаВнутреннееПотребление", "торо_РезервыНаСкладахОстатки.ЗаказНаВнутреннееПотребление");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЗаказНаВнутреннееПотребление", "ЗНАЧЕНИЕ(Документ.ЗаказНаВнутреннееПотребление.ПустаяСсылка)");
		Запрос.УстановитьПараметр("ВнутреннийЗаказ", Истина);
	КонецЕсли;
	Запрос.УстановитьПараметр("Дата", Новый Граница(МоментВремени(), ВидГраницы.Включая));

	Запрос.Выполнить();
	ПроверитьПревышениеОстатка(Запрос.МенеджерВременныхТаблиц, Отказ, ФОИспользоватьСерии, ФОИспользоватьХарактеристики);

	Если Отказ И ИспользуетсяКонтрольОстатков Тогда 
		Возврат;
	ИначеЕсли НЕ ИспользуетсяКонтрольОстатков Тогда  
		Отказ = Ложь;
	КонецЕсли;

	#Вставка
	//++ Проф-ИТ, #27, Соловьев А.А., 23.08.2023
	проф_ОбщегоНазначенияВызовСервера.ПроверитьПревышениеОстатка(Запрос.МенеджерВременныхТаблиц, Отказ, ФОИспользоватьСерии, ФОИспользоватьХарактеристики, ЭтотОбъект, Склад);
	Если Отказ И ИспользуетсяКонтрольОстатков Тогда 
		Возврат;
	ИначеЕсли НЕ ИспользуетсяКонтрольОстатков Тогда  
		Отказ = Ложь;
	КонецЕсли;
	//-- Проф-ИТ, #27, Соловьев А.А., 23.08.2023
	#КонецВставки
	Если ПотреблениеПоЗаказам Тогда
		СписатьЗаказыНаВнутреннееПотребление(Запрос.МенеджерВременныхТаблиц, Отказ, ФОИспользоватьСерии, ФОИспользоватьХарактеристики);
		Если Отказ Тогда 
			Возврат;
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_РезервыНаРукахОстатки.Склад КАК Склад,
		|	торо_РезервыНаРукахОстатки.Номенклатура КАК Номенклатура,
		|	торо_РезервыНаРукахОстатки.Характеристика КАК Характеристика,
		|	торо_РезервыНаРукахОстатки.Серия КАК Серия,
		|	торо_РезервыНаРукахОстатки.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотребление,
		|	торо_РезервыНаРукахОстатки.ДокументРезерв КАК ДокументРезерв,
		|	торо_РезервыНаРукахОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ РезервыНаРуках
		|ИЗ
		|	РегистрНакопления.торо_РезервыНаРуках.Остатки(
		|			&Дата,
		|			(ЗаказНаВнутреннееПотребление, Номенклатура, Характеристика, Серия, Склад) В
		|				(ВЫБРАТЬ
		|					Таблица.ЗаказНаВнутреннееПотребление,
		|					Таблица.Номенклатура,
		|					Таблица.Характеристика,
		|					Таблица.Серия,
		|					Таблица.Склад
		|				ИЗ
		|					Таблица)) КАК торо_РезервыНаРукахОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Характеристика,
		|	Номенклатура,
		|	Склад,
		|	Серия,
		|	ЗаказНаВнутреннееПотребление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_РезервыНаСкладахОстатки.Склад КАК Склад,
		|	торо_РезервыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	торо_РезервыНаСкладахОстатки.Характеристика КАК Характеристика,
		|	торо_РезервыНаСкладахОстатки.Серия КАК Серия,
		|	торо_РезервыНаСкладахОстатки.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотребление,
		|	торо_РезервыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	торо_РезервыНаСкладахОстатки.ДокументРезерв КАК ДокументРезерв
		|ПОМЕСТИТЬ РезервыНаСкладахСДокументами
		|ИЗ
		|	РегистрНакопления.торо_РезервыНаСкладах.Остатки(
		|			&Дата,
		|			(ЗаказНаВнутреннееПотребление, Номенклатура, Характеристика, Серия, Склад) В
		|				(ВЫБРАТЬ
		|					Таблица.ЗаказНаВнутреннееПотребление,
		|					Таблица.Номенклатура,
		|					Таблица.Характеристика,
		|					Таблица.Серия,
		|					Таблица.Склад
		|				ИЗ
		|					Таблица)) КАК торо_РезервыНаСкладахОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	Характеристика,
		|	Склад,
		|	Серия,
		|	ЗаказНаВнутреннееПотребление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Остатки.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотребление,
		|	Остатки.Склад КАК Склад,
		|	Остатки.Номенклатура КАК Номенклатура,
		|	Остатки.Характеристика КАК Характеристика,
		|	Остатки.Количество КАК Количество,
		|	Остатки.Серия КАК Серия,
		|	Остатки.НаСкладе КАК НаСкладе,
		|	Остатки.НаРуках КАК НаРуках
		|ИЗ
		|	Остатки КАК Остатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Остатки.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотребление,
		|	Остатки.Склад КАК Склад,
		|	Остатки.Номенклатура КАК Номенклатура,
		|	Остатки.Характеристика КАК Характеристика,
		|	Остатки.Количество КАК Количество,
		|	Остатки.Серия КАК Серия,
		|	Остатки.НаСкладе КАК НаСкладе,
		|	Остатки.НаРуках КАК НаРуках,
		|	ЕСТЬNULL(РезервыНаСкладах.ДокументРезерв, ЗНАЧЕНИЕ(Документ.торо_РезервПодВнутреннийЗаказ.ПустаяСсылка)) КАК ДокументРезерв,
		|	ЕСТЬNULL(РезервыНаСкладах.КоличествоОстаток, 0) КАК РезервНаСкладе
		|ИЗ
		|	Остатки КАК Остатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РезервыНаСкладахСДокументами КАК РезервыНаСкладах
		|		ПО Остатки.Склад = РезервыНаСкладах.Склад
		|			И Остатки.Номенклатура = РезервыНаСкладах.Номенклатура
		|			И Остатки.Характеристика = РезервыНаСкладах.Характеристика
		|			И Остатки.Серия = РезервыНаСкладах.Серия
		|			И Остатки.ЗаказНаВнутреннееПотребление = РезервыНаСкладах.ЗаказНаВнутреннееПотребление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Остатки.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотребление,
		|	Остатки.Склад КАК Склад,
		|	Остатки.Номенклатура КАК Номенклатура,
		|	Остатки.Характеристика КАК Характеристика,
		|	Остатки.Количество КАК Количество,
		|	Остатки.Серия КАК Серия,
		|	Остатки.НаСкладе КАК НаСкладе,
		|	Остатки.НаРуках КАК НаРуках,
		|	ЕСТЬNULL(РезервыНаРуках.ДокументРезерв, ЗНАЧЕНИЕ(Документ.торо_РезервПодВнутреннийЗаказ.ПустаяСсылка)) КАК ДокументРезерв,
		|	ЕСТЬNULL(РезервыНаРуках.КоличествоОстаток, 0) КАК РезервНаРуках
		|ИЗ
		|	Остатки КАК Остатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РезервыНаРуках КАК РезервыНаРуках
		|		ПО Остатки.Склад = РезервыНаРуках.Склад
		|			И Остатки.Номенклатура = РезервыНаРуках.Номенклатура
		|			И Остатки.Характеристика = РезервыНаРуках.Характеристика
		|			И Остатки.Серия = РезервыНаРуках.Серия
		|			И Остатки.ЗаказНаВнутреннееПотребление = РезервыНаРуках.ЗаказНаВнутреннееПотребление";
		РезЗапроса = Запрос.ВыполнитьПакет();
		Выборка = РезЗапроса[2].Выбрать();
		Если НЕ РезЗапроса[3].Пустой() Тогда 
			РезервыНаСкладах = РезЗапроса[3].Выгрузить();
			РезервыНаСкладах.Индексы.Добавить("Склад");
			РезервыНаСкладах.Индексы.Добавить("Номенклатура");
			РезервыНаСкладах.Индексы.Добавить("Характеристика");
			РезервыНаСкладах.Индексы.Добавить("Серия");
		Иначе
			РезервыНаСкладах = Новый ТаблицаЗначений;
		КонецЕсли;
		Если НЕ РезЗапроса[4].Пустой() Тогда 
			РезервыНаРуках = РезЗапроса[4].Выгрузить();
			РезервыНаРуках.Индексы.Добавить("Склад");
			РезервыНаРуках.Индексы.Добавить("Номенклатура");
			РезервыНаРуках.Индексы.Добавить("Характеристика");
			РезервыНаРуках.Индексы.Добавить("Серия");
		Иначе
			РезервыНаРуках = Новый ТаблицаЗначений;
		КонецЕсли;
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		|	Остатки.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотребление,
		|	Остатки.Склад КАК Склад,
		|	Остатки.Номенклатура КАК Номенклатура,
		|	Остатки.Характеристика КАК Характеристика,
		|	Остатки.Количество КАК Количество,
		|	Остатки.Серия КАК Серия,
		|	Остатки.НаСкладе КАК НаСкладе,
		|	0 КАК НаРуках
		|ИЗ
		|	Остатки КАК Остатки";
		РезЗапроса = Запрос.Выполнить();
		Выборка = РезЗапроса.Выбрать();
		РезервыНаСкладах = Новый ТаблицаЗначений;
		РезервыНаРуках = Новый ТаблицаЗначений;
	КонецЕсли;

	СтруктураПоиска = Новый Структура("Склад, Номенклатура, Характеристика, Серия");  
	Пока Выборка.Следующий() Цикл 
		НадоСписать = Выборка.Количество;
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, Выборка);
		Если Выборка.НаРуках > 0 Тогда
			СписатьОстаток = Мин(НадоСписать, Выборка.НаРуках);
			Движение = Движения.торо_ТоварыНаРуках.ДобавитьРасход();
			Движение.Период = Дата;
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
			Движение.Количество = СписатьОстаток;
			Если РезервыНаРуках.Количество() Тогда
				НайденныеРезервы = РезервыНаРуках.НайтиСтроки(СтруктураПоиска);
				СписатьРезерв = СписатьОстаток;
				Для Каждого СтрокаРезерв Из НайденныеРезервы Цикл
					Если СписатьРезерв = 0 ИЛИ СтрокаРезерв.РезервНаРуках <= 0 Тогда
						Прервать;
					КонецЕсли;
					Движение = Движения.торо_РезервыНаРуках.ДобавитьРасход();
					ЗаполнитьЗначенияСвойств(Движение, СтрокаРезерв);
					Движение.Период = Дата;
					Списать = Мин(СтрокаРезерв.РезервНаРуках, СписатьРезерв);
					Движение.Количество = Списать;
					СписатьРезерв = СписатьРезерв - Списать;
				КонецЦикла;
			КонецЕсли;
			НадоСписать = НадоСписать - СписатьОстаток;
		КонецЕсли;

		Если НадоСписать > 0 Тогда
			Движение = Движения.ТоварыНаСкладах.ДобавитьРасход();
			Движение.Период = Дата;
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
			Движение.ВНаличии = НадоСписать;
			Если РезервыНаСкладах.Количество() Тогда
				НайденныеРезервы = РезервыНаСкладах.НайтиСтроки(СтруктураПоиска);
				СписатьРезерв = НадоСписать;
				Для Каждого СтрокаРезерв Из НайденныеРезервы Цикл
					Если СтрокаРезерв.РезервНаСкладе <= 0 Тогда
						Прервать;
					КонецЕсли;
					Движение = Движения.торо_РезервыНаСкладах.ДобавитьРасход();
					ЗаполнитьЗначенияСвойств(Движение, СтрокаРезерв);
					Движение.Период = Дата;
					Списать = Мин(СписатьРезерв, СтрокаРезерв.РезервНаСкладе);
					Движение.Количество = Списать;
					СписатьРезерв = СписатьРезерв - Списать;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	#Вставка
	//++ Проф-ИТ, #27, Соловьев А.А., 24.08.2023
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Остатки.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотребление,
	|	Остатки.Склад КАК Склад,
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.Характеристика КАК Характеристика,
	|	Остатки.Количество КАК Количество,
	|	Остатки.Серия КАК Серия,
	|	Остатки.Назначение КАК Назначение
	|ИЗ
	|	проф_Остатки КАК Остатки";
	РезЗапроса = Запрос.Выполнить();
	Выборка = РезЗапроса.Выбрать();
	РезервыНаСкладах = Новый ТаблицаЗначений;
	РезервыНаРуках = Новый ТаблицаЗначений;	
	
	Пока Выборка.Следующий() Цикл 
		НадоСписать = Выборка.Количество;
		Если НадоСписать > 0 Тогда
			Движение = Движения.проф_ТоварыНаСкладах.ДобавитьРасход();
			Движение.Период = Дата;
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
			Движение.ВНаличии = НадоСписать;
		КонецЕсли;
	КонецЦикла;
	//-- Проф-ИТ, #27, Соловьев А.А., 24.08.2023
	//++ Проф-ИТ, #329, Соловьев А.А., 08.11.2023
	Если Не Отказ Тогда 
		проф_ДвиженияПоРегистру_проф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт();
	КонецЕсли;
	//-- Проф-ИТ, #329, Соловьев А.А., 08.11.2023
	#КонецВставки
	Движения.Записать();

КонецПроцедуры

//++ Проф-ИТ, #303, Корнилов М.С., 13.10.2023
&После("ПередЗаписью")
Процедура проф_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ПотреблениеПоЗаказам = Ложь Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Документ должен быть привязан к Заказу на внутреннее потребление!";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	//++ Проф-ИТ, #401, Соловьев А.А., 11.12.2023
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		проф_ОбщегоНазначенияВызовСервера.ПроверитьПризнакПодразделенияОрганизации(ЭтотОбъект["Подразделение"], Отказ);
	КонецЕсли;
	//-- Проф-ИТ, #401, Соловьев А.А., 11.12.2023
	
КонецПроцедуры
//-- Проф-ИТ, #303, Корнилов М.С., 13.10.2023

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&ИзменениеИКонтроль("УстановитьБлокировку")
Процедура проф_УстановитьБлокировку()
	Блокировка = Новый БлокировкаДанных;

	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыНаСкладах");
	ЭлементБлокировки.ИсточникДанных = Товары;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Характеристика", "Характеристика");
	ЭлементБлокировки.УстановитьЗначение("Склад", Склад);
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Серия", "Серия");

	#Вставка
	//++ Проф-ИТ, #27, Соловьев А.А., 23.08.2023
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.проф_ТоварыНаСкладах");
	ЭлементБлокировки.ИсточникДанных = Товары;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Характеристика", "Характеристика");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Назначение", "проф_Назначение");
	ЭлементБлокировки.УстановитьЗначение("Склад", Склад);
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Серия", "Серия");
	//-- Проф-ИТ, #27, Соловьев А.А., 23.08.2023
	#КонецВставки
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.торо_ТоварыНаРуках");
	ЭлементБлокировки.ИсточникДанных = Товары;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Характеристика", "Характеристика");
	ЭлементБлокировки.УстановитьЗначение("Склад", Склад); 
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Серия", "Серия");	
	ЭлементБлокировки.УстановитьЗначение("ЗаказНаВнутреннееПотребление", ЗаказНаВнутреннееПотребление);

	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.торо_РезервыНаСкладах");
	ЭлементБлокировки.ИсточникДанных = Товары;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура"); 
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Характеристика", "Характеристика");
	ЭлементБлокировки.УстановитьЗначение("Склад", Склад);
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Серия", "Серия");

	Если ПотреблениеПоЗаказам Тогда 
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ЗаказыНаВнутреннееПотребление");
		ЭлементБлокировки.ИсточникДанных = Товары;
		ЭлементБлокировки.УстановитьЗначение("ЗаказНаВнутреннееПотребление", ЗаказНаВнутреннееПотребление);
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Характеристика", "Характеристика");
		ЭлементБлокировки.УстановитьЗначение("Склад", Склад);
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Серия", "Серия");

		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.торо_РезервыНаРуках");
		ЭлементБлокировки.ИсточникДанных = Товары;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Характеристика", "Характеристика");
		ЭлементБлокировки.УстановитьЗначение("Склад", Склад);
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Серия", "Серия");	
		ЭлементБлокировки.УстановитьЗначение("ЗаказНаВнутреннееПотребление", ЗаказНаВнутреннееПотребление);
	КонецЕсли;

	Блокировка.Заблокировать();
КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьПоЗаказу")
Процедура проф_ЗаполнитьПоЗаказу(ДанныеЗаполнения, РеквизитыШапки, ЗаполнятьНаДату, ОтборТовары)

	ТипДанныеЗаполнения = ТипЗнч(ДанныеЗаполнения);

	Если ТипДанныеЗаполнения = Тип("Массив") Тогда

		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыШапки);

	ИначеЕсли ТипДанныеЗаполнения = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда

		ЗаказНаВнутреннееПотребление = ДанныеЗаполнения;

		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Заказы.Ссылка КАК ЗаказНаВнутреннееПотребление,
		|	Заказы.Организация КАК Организация,
		|	Заказы.Подразделение КАК Подразделение,
		|	Заказы.Склад КАК Склад,
		|	Заказы.Склад.УчетныйВидЦены КАК ВидЦены,
		#Вставка
		//++ Проф-ИТ, #183, Соловьев А.А., 15.09.2023
		|	Заказы.проф_НаправлениеДеятельности КАК проф_НаправлениеДеятельности,
		|	Заказы.проф_Назначение КАК проф_Назначение,
		|	Заказы.проф_ХозяйственнаяОперация КАК проф_ХозяйственнаяОперация,
		//-- Проф-ИТ, #183, Соловьев А.А., 15.09.2023
		//++ Проф-ИТ, #27, Соловьев А.А., 25.09.2023
		|	Заказы.ДокументОснование КАК проф_ДокументОснование,
		//-- Проф-ИТ, #27, Соловьев А.А., 25.09.2023
		#КонецВставки
		|	(НЕ Заказы.Проведен) КАК ЕстьОшибкиПроведен
		|ИЗ
		|	Документ.ЗаказНаВнутреннееПотребление КАК Заказы
		|ГДЕ
		|	Заказы.Ссылка = &Заказ");

		Запрос.УстановитьПараметр("Заказ", ЗаказНаВнутреннееПотребление);
		РеквизитыЗаказа = Запрос.Выполнить().Выбрать();
		РеквизитыЗаказа.Следующий();

		МассивДопустимыхСтатусов = Новый Массив();

		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыЗаказа);

	КонецЕсли;

	ПотреблениеПоЗаказам = Истина;

	Если ТипДанныеЗаполнения = Тип("Массив") Тогда
		МассивЗаказов = ДанныеЗаполнения;
	Иначе
		МассивЗаказов = Новый Массив;
		МассивЗаказов.Добавить(ЗаказНаВнутреннееПотребление);
	КонецЕсли;

	Документы.ВнутреннееПотреблениеТоваров.ЗаполнитьПоОстаткамЗаказов(ЭтотОбъект,Товары,МассивЗаказов);

	Если ОтборТовары <> Неопределено Тогда
		СтрокиКУдалению = Новый Массив;
		СтруктураПоиска = Новый Структура("ЗаказНаВнутреннееПотребление,КодСтроки");
		Для каждого ДанныеСтроки Из Товары Цикл
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, ДанныеСтроки);
			СписокСтрок = ОтборТовары.НайтиСтроки(СтруктураПоиска);
			Если СписокСтрок.Количество() = 0 Тогда
				СтрокиКУдалению.Добавить(ДанныеСтроки);	
			КонецЕсли; 
		КонецЦикла;
		Для каждого ДанныеСтроки Из СтрокиКУдалению Цикл
			Товары.Удалить(ДанныеСтроки);
		КонецЦикла; 
	КонецЕсли; 

	ЗаполнитьЗаказВШапкеПоЗаказамВТабличнойЧасти(ЗаказНаВнутреннееПотребление, Товары, "ЗаказНаВнутреннееПотребление");

КонецПроцедуры

//++ Проф-ИТ, #303, Корнилов М.С., 13.10.2023
Процедура проф_ПроверитьТЧТоварыИнвентарныйНомер(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Товары.НомерСтроки КАК НомерСтроки,
		|	Товары.проф_КатегорииЭксплуатации КАК КатегорииЭксплуатации,
		|	Товары.проф_ИнвентарныйНомер КАК ИнвентарныйНомер
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&Товары КАК Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.проф_КатегорииЭксплуатации КАК проф_КатегорииЭксплуатации
		|		ПО ВТ_Товары.КатегорииЭксплуатации = проф_КатегорииЭксплуатации.Ссылка
		|			И (проф_КатегорииЭксплуатации.ИнвентарныйУчет = ИСТИНА)
		|			И (ВТ_Товары.ИнвентарныйНомер = """")";
	
	Запрос.УстановитьПараметр("Товары", Товары);	
	ВыборкаТовары = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаТовары.Следующий() Цикл
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = СтрШаблон("Не заполнена колонка ""Инвентарный номер (Проф-ИТ)"" в строке %1 списка ""Товары""",
			ВыборкаТовары.НомерСтроки);
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЦикла;
	
КонецПроцедуры	
//-- Проф-ИТ, #303, Корнилов М.С., 13.10.2023

//++ Проф-ИТ, #329, Соловьев А.А., 08.11.2023
Процедура проф_ДвиженияПоРегистру_проф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт()
	
	Движения.проф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧТовары.Номенклатура КАК Номенклатура,
	|	ТЧТовары.Характеристика КАК Характеристика,
	|	ТЧТовары.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотребление,
	|	СУММА(ТЧТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	Документ.ВнутреннееПотреблениеТоваров.Товары КАК ТЧТовары
	|ГДЕ
	|	ТЧТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧТовары.Номенклатура,
	|	ТЧТовары.Характеристика,
	|	ТЧТовары.ЗаказНаВнутреннееПотребление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ИнтеграцияДокументов.ДокументЕРП КАК Заказ,
	|	торо_ИнтеграцияДокументов.ID КАК ID
	|ПОМЕСТИТЬ Заказы
	|ИЗ
	|	РегистрСведений.торо_ИнтеграцияДокументов КАК торо_ИнтеграцияДокументов
	|ГДЕ
	|	торо_ИнтеграцияДокументов.ДокументЕРП В 
	|			(ВЫБРАТЬ 
	|				втТовары.ЗаказНаВнутреннееПотребление 
	|			ИЗ 
	|				втТовары КАК втТовары)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ИнтеграцияДокументов.ДокументЕРП КАК ВнутреннееПотребление,
	|	торо_ИнтеграцияДокументов.ID КАК ID
	|ПОМЕСТИТЬ втСоответствиеДокументов
	|ИЗ
	|	РегистрСведений.торо_ИнтеграцияДокументов КАК торо_ИнтеграцияДокументов
	|ГДЕ
	|	торо_ИнтеграцияДокументов.ДокументЕРП = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ИнтеграцияДокументов.ДокументЕРП,
	|	торо_ИнтеграцияДокументов.ID
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВнутреннееПотреблениеТоваров.Ссылка,
	|	Заказы.ID
	|ИЗ
	|	Заказы КАК Заказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров.Товары КАК ВнутреннееПотреблениеТоваров
	|		ПО Заказы.Заказ = ВнутреннееПотреблениеТоваров.ЗаказНаВнутреннееПотребление
	|		И  (ВнутреннееПотреблениеТоваров.ЗаказНаВнутреннееПотребление = &Ссылка)
	|ГДЕ
	|	НЕ ВнутреннееПотреблениеТоваров.Ссылка.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка КАК АктОВыполненииЭтапаРабот,
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID КАК ID
	|ПОМЕСТИТЬ втАкты
	|ИЗ
	|	Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
	|ГДЕ
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID В
	|			(ВЫБРАТЬ
	|				втСоответствиеДокументов.ID
	|			ИЗ
	|				втСоответствиеДокументов КАК втСоответствиеДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка,
	|	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	втАкты.АктОВыполненииЭтапаРабот КАК АктОВыполненииЭтапаРабот,
	|	втТовары.Номенклатура КАК Номенклатура,
	|	втТовары.Характеристика КАК Характеристика,
	|	СУММА(втТовары.Количество) КАК Количество
	|ИЗ
	|	втТовары КАК втТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСоответствиеДокументов КАК втСоответствиеДокументов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАкты КАК втАкты
	|			ПО втСоответствиеДокументов.ID = втАкты.ID
	|		ПО (ИСТИНА)
	|
	|СГРУППИРОВАТЬ ПО
	|	втАкты.АктОВыполненииЭтапаРабот,
	|	втТовары.Номенклатура,
	|	втТовары.Характеристика";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.проф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		Движение.Период = Дата;
		
	КонецЦикла;
	
КонецПроцедуры
//-- Проф-ИТ, #329, Соловьев А.А., 08.11.2023

#КонецОбласти
